RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dsp2_middle3_reg.h
/**
  ******************************************************************************
  * @file    dsp2_middle3_reg.h
  * @version V1.0
  * @date    2021-09-10
  * @brief   This file is the description of.IP register
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2020 Bouffalo Lab</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of Bouffalo Lab nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
#ifndef __DSP2_MIDDLE3_REG_H__
#define __DSP2_MIDDLE3_REG_H__

#include "bl808.h"

/* 0x500 : awb2_sta_xaxis */
#define DSP2_MIDDLE3_AWB2_STA_XAXIS_OFFSET (0x500)
#define DSP2_MIDDLE3_AWB2_X_MIN_PRE        DSP2_MIDDLE3_AWB2_X_MIN_PRE
#define DSP2_MIDDLE3_AWB2_X_MIN_PRE_POS    (0U)
#define DSP2_MIDDLE3_AWB2_X_MIN_PRE_LEN    (11U)
#define DSP2_MIDDLE3_AWB2_X_MIN_PRE_MSK    (((1U << DSP2_MIDDLE3_AWB2_X_MIN_PRE_LEN) - 1) << DSP2_MIDDLE3_AWB2_X_MIN_PRE_POS)
#define DSP2_MIDDLE3_AWB2_X_MIN_PRE_UMSK   (~(((1U << DSP2_MIDDLE3_AWB2_X_MIN_PRE_LEN) - 1) << DSP2_MIDDLE3_AWB2_X_MIN_PRE_POS))
#define DSP2_MIDDLE3_AWB2_X_MAX_PRE        DSP2_MIDDLE3_AWB2_X_MAX_PRE
#define DSP2_MIDDLE3_AWB2_X_MAX_PRE_POS    (16U)
#define DSP2_MIDDLE3_AWB2_X_MAX_PRE_LEN    (11U)
#define DSP2_MIDDLE3_AWB2_X_MAX_PRE_MSK    (((1U << DSP2_MIDDLE3_AWB2_X_MAX_PRE_LEN) - 1) << DSP2_MIDDLE3_AWB2_X_MAX_PRE_POS)
#define DSP2_MIDDLE3_AWB2_X_MAX_PRE_UMSK   (~(((1U << DSP2_MIDDLE3_AWB2_X_MAX_PRE_LEN) - 1) << DSP2_MIDDLE3_AWB2_X_MAX_PRE_POS))

/* 0x504 : awb2_sta_yaxis */
#define DSP2_MIDDLE3_AWB2_STA_YAXIS_OFFSET (0x504)
#define DSP2_MIDDLE3_AWB2_Y_MIN_PRE        DSP2_MIDDLE3_AWB2_Y_MIN_PRE
#define DSP2_MIDDLE3_AWB2_Y_MIN_PRE_POS    (0U)
#define DSP2_MIDDLE3_AWB2_Y_MIN_PRE_LEN    (11U)
#define DSP2_MIDDLE3_AWB2_Y_MIN_PRE_MSK    (((1U << DSP2_MIDDLE3_AWB2_Y_MIN_PRE_LEN) - 1) << DSP2_MIDDLE3_AWB2_Y_MIN_PRE_POS)
#define DSP2_MIDDLE3_AWB2_Y_MIN_PRE_UMSK   (~(((1U << DSP2_MIDDLE3_AWB2_Y_MIN_PRE_LEN) - 1) << DSP2_MIDDLE3_AWB2_Y_MIN_PRE_POS))
#define DSP2_MIDDLE3_AWB2_Y_MAX_PRE        DSP2_MIDDLE3_AWB2_Y_MAX_PRE
#define DSP2_MIDDLE3_AWB2_Y_MAX_PRE_POS    (16U)
#define DSP2_MIDDLE3_AWB2_Y_MAX_PRE_LEN    (11U)
#define DSP2_MIDDLE3_AWB2_Y_MAX_PRE_MSK    (((1U << DSP2_MIDDLE3_AWB2_Y_MAX_PRE_LEN) - 1) << DSP2_MIDDLE3_AWB2_Y_MAX_PRE_POS)
#define DSP2_MIDDLE3_AWB2_Y_MAX_PRE_UMSK   (~(((1U << DSP2_MIDDLE3_AWB2_Y_MAX_PRE_LEN) - 1) << DSP2_MIDDLE3_AWB2_Y_MAX_PRE_POS))

/* 0x508 : awb2_sta_pixel_num */
#define DSP2_MIDDLE3_AWB2_STA_PIXEL_NUM_OFFSET (0x508)
#define DSP2_MIDDLE3_AWB2_PIXEL_NUM_PRE        DSP2_MIDDLE3_AWB2_PIXEL_NUM_PRE
#define DSP2_MIDDLE3_AWB2_PIXEL_NUM_PRE_POS    (0U)
#define DSP2_MIDDLE3_AWB2_PIXEL_NUM_PRE_LEN    (21U)
#define DSP2_MIDDLE3_AWB2_PIXEL_NUM_PRE_MSK    (((1U << DSP2_MIDDLE3_AWB2_PIXEL_NUM_PRE_LEN) - 1) << DSP2_MIDDLE3_AWB2_PIXEL_NUM_PRE_POS)
#define DSP2_MIDDLE3_AWB2_PIXEL_NUM_PRE_UMSK   (~(((1U << DSP2_MIDDLE3_AWB2_PIXEL_NUM_PRE_LEN) - 1) << DSP2_MIDDLE3_AWB2_PIXEL_NUM_PRE_POS))

/* 0x50C : awb2_sta_gain0 */
#define DSP2_MIDDLE3_AWB2_STA_GAIN0_OFFSET    (0x50C)
#define DSP2_MIDDLE3_AWB2_STAT_GGAIN_PRE      DSP2_MIDDLE3_AWB2_STAT_GGAIN_PRE
#define DSP2_MIDDLE3_AWB2_STAT_GGAIN_PRE_POS  (0U)
#define DSP2_MIDDLE3_AWB2_STAT_GGAIN_PRE_LEN  (16U)
#define DSP2_MIDDLE3_AWB2_STAT_GGAIN_PRE_MSK  (((1U << DSP2_MIDDLE3_AWB2_STAT_GGAIN_PRE_LEN) - 1) << DSP2_MIDDLE3_AWB2_STAT_GGAIN_PRE_POS)
#define DSP2_MIDDLE3_AWB2_STAT_GGAIN_PRE_UMSK (~(((1U << DSP2_MIDDLE3_AWB2_STAT_GGAIN_PRE_LEN) - 1) << DSP2_MIDDLE3_AWB2_STAT_GGAIN_PRE_POS))
#define DSP2_MIDDLE3_AWB2_STAT_RGAIN_PRE      DSP2_MIDDLE3_AWB2_STAT_RGAIN_PRE
#define DSP2_MIDDLE3_AWB2_STAT_RGAIN_PRE_POS  (16U)
#define DSP2_MIDDLE3_AWB2_STAT_RGAIN_PRE_LEN  (16U)
#define DSP2_MIDDLE3_AWB2_STAT_RGAIN_PRE_MSK  (((1U << DSP2_MIDDLE3_AWB2_STAT_RGAIN_PRE_LEN) - 1) << DSP2_MIDDLE3_AWB2_STAT_RGAIN_PRE_POS)
#define DSP2_MIDDLE3_AWB2_STAT_RGAIN_PRE_UMSK (~(((1U << DSP2_MIDDLE3_AWB2_STAT_RGAIN_PRE_LEN) - 1) << DSP2_MIDDLE3_AWB2_STAT_RGAIN_PRE_POS))

/* 0x510 : awb2_sta_gain1 */
#define DSP2_MIDDLE3_AWB2_STA_GAIN1_OFFSET    (0x510)
#define DSP2_MIDDLE3_AWB2_RGAIN_PRE           DSP2_MIDDLE3_AWB2_RGAIN_PRE
#define DSP2_MIDDLE3_AWB2_RGAIN_PRE_POS       (0U)
#define DSP2_MIDDLE3_AWB2_RGAIN_PRE_LEN       (16U)
#define DSP2_MIDDLE3_AWB2_RGAIN_PRE_MSK       (((1U << DSP2_MIDDLE3_AWB2_RGAIN_PRE_LEN) - 1) << DSP2_MIDDLE3_AWB2_RGAIN_PRE_POS)
#define DSP2_MIDDLE3_AWB2_RGAIN_PRE_UMSK      (~(((1U << DSP2_MIDDLE3_AWB2_RGAIN_PRE_LEN) - 1) << DSP2_MIDDLE3_AWB2_RGAIN_PRE_POS))
#define DSP2_MIDDLE3_AWB2_STAT_BGAIN_PRE      DSP2_MIDDLE3_AWB2_STAT_BGAIN_PRE
#define DSP2_MIDDLE3_AWB2_STAT_BGAIN_PRE_POS  (16U)
#define DSP2_MIDDLE3_AWB2_STAT_BGAIN_PRE_LEN  (16U)
#define DSP2_MIDDLE3_AWB2_STAT_BGAIN_PRE_MSK  (((1U << DSP2_MIDDLE3_AWB2_STAT_BGAIN_PRE_LEN) - 1) << DSP2_MIDDLE3_AWB2_STAT_BGAIN_PRE_POS)
#define DSP2_MIDDLE3_AWB2_STAT_BGAIN_PRE_UMSK (~(((1U << DSP2_MIDDLE3_AWB2_STAT_BGAIN_PRE_LEN) - 1) << DSP2_MIDDLE3_AWB2_STAT_BGAIN_PRE_POS))

