RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dsp2_middle3_reg.h
/* 0x514 : awb2_sta_gain2 */
#define DSP2_MIDDLE3_AWB2_STA_GAIN2_OFFSET (0x514)
#define DSP2_MIDDLE3_AWB2_BGAIN_PRE        DSP2_MIDDLE3_AWB2_BGAIN_PRE
#define DSP2_MIDDLE3_AWB2_BGAIN_PRE_POS    (0U)
#define DSP2_MIDDLE3_AWB2_BGAIN_PRE_LEN    (16U)
#define DSP2_MIDDLE3_AWB2_BGAIN_PRE_MSK    (((1U << DSP2_MIDDLE3_AWB2_BGAIN_PRE_LEN) - 1) << DSP2_MIDDLE3_AWB2_BGAIN_PRE_POS)
#define DSP2_MIDDLE3_AWB2_BGAIN_PRE_UMSK   (~(((1U << DSP2_MIDDLE3_AWB2_BGAIN_PRE_LEN) - 1) << DSP2_MIDDLE3_AWB2_BGAIN_PRE_POS))
#define DSP2_MIDDLE3_AWB2_GGAIN_PRE        DSP2_MIDDLE3_AWB2_GGAIN_PRE
#define DSP2_MIDDLE3_AWB2_GGAIN_PRE_POS    (16U)
#define DSP2_MIDDLE3_AWB2_GGAIN_PRE_LEN    (16U)
#define DSP2_MIDDLE3_AWB2_GGAIN_PRE_MSK    (((1U << DSP2_MIDDLE3_AWB2_GGAIN_PRE_LEN) - 1) << DSP2_MIDDLE3_AWB2_GGAIN_PRE_POS)
#define DSP2_MIDDLE3_AWB2_GGAIN_PRE_UMSK   (~(((1U << DSP2_MIDDLE3_AWB2_GGAIN_PRE_LEN) - 1) << DSP2_MIDDLE3_AWB2_GGAIN_PRE_POS))

/* 0x518 : awb2_sta_gain3 */
#define DSP2_MIDDLE3_AWB2_STA_GAIN3_OFFSET (0x518)
#define DSP2_MIDDLE3_AWB2_VGAIN_PRE        DSP2_MIDDLE3_AWB2_VGAIN_PRE
#define DSP2_MIDDLE3_AWB2_VGAIN_PRE_POS    (0U)
#define DSP2_MIDDLE3_AWB2_VGAIN_PRE_LEN    (10U)
#define DSP2_MIDDLE3_AWB2_VGAIN_PRE_MSK    (((1U << DSP2_MIDDLE3_AWB2_VGAIN_PRE_LEN) - 1) << DSP2_MIDDLE3_AWB2_VGAIN_PRE_POS)
#define DSP2_MIDDLE3_AWB2_VGAIN_PRE_UMSK   (~(((1U << DSP2_MIDDLE3_AWB2_VGAIN_PRE_LEN) - 1) << DSP2_MIDDLE3_AWB2_VGAIN_PRE_POS))
#define DSP2_MIDDLE3_AWB2_UGAIN_PRE        DSP2_MIDDLE3_AWB2_UGAIN_PRE
#define DSP2_MIDDLE3_AWB2_UGAIN_PRE_POS    (16U)
#define DSP2_MIDDLE3_AWB2_UGAIN_PRE_LEN    (10U)
#define DSP2_MIDDLE3_AWB2_UGAIN_PRE_MSK    (((1U << DSP2_MIDDLE3_AWB2_UGAIN_PRE_LEN) - 1) << DSP2_MIDDLE3_AWB2_UGAIN_PRE_POS)
#define DSP2_MIDDLE3_AWB2_UGAIN_PRE_UMSK   (~(((1U << DSP2_MIDDLE3_AWB2_UGAIN_PRE_LEN) - 1) << DSP2_MIDDLE3_AWB2_UGAIN_PRE_POS))

/* 0x51C : awb2_sta_l0 */
#define DSP2_MIDDLE3_AWB2_STA_L0_OFFSET (0x51C)
#define DSP2_MIDDLE3_AWB2_YTH1_PRE      DSP2_MIDDLE3_AWB2_YTH1_PRE
#define DSP2_MIDDLE3_AWB2_YTH1_PRE_POS  (0U)
#define DSP2_MIDDLE3_AWB2_YTH1_PRE_LEN  (8U)
#define DSP2_MIDDLE3_AWB2_YTH1_PRE_MSK  (((1U << DSP2_MIDDLE3_AWB2_YTH1_PRE_LEN) - 1) << DSP2_MIDDLE3_AWB2_YTH1_PRE_POS)
#define DSP2_MIDDLE3_AWB2_YTH1_PRE_UMSK (~(((1U << DSP2_MIDDLE3_AWB2_YTH1_PRE_LEN) - 1) << DSP2_MIDDLE3_AWB2_YTH1_PRE_POS))
#define DSP2_MIDDLE3_AWB2_YTH2_PRE      DSP2_MIDDLE3_AWB2_YTH2_PRE
#define DSP2_MIDDLE3_AWB2_YTH2_PRE_POS  (8U)
#define DSP2_MIDDLE3_AWB2_YTH2_PRE_LEN  (8U)
#define DSP2_MIDDLE3_AWB2_YTH2_PRE_MSK  (((1U << DSP2_MIDDLE3_AWB2_YTH2_PRE_LEN) - 1) << DSP2_MIDDLE3_AWB2_YTH2_PRE_POS)
#define DSP2_MIDDLE3_AWB2_YTH2_PRE_UMSK (~(((1U << DSP2_MIDDLE3_AWB2_YTH2_PRE_LEN) - 1) << DSP2_MIDDLE3_AWB2_YTH2_PRE_POS))
#define DSP2_MIDDLE3_AWB2_YTH3_PRE      DSP2_MIDDLE3_AWB2_YTH3_PRE
#define DSP2_MIDDLE3_AWB2_YTH3_PRE_POS  (16U)
#define DSP2_MIDDLE3_AWB2_YTH3_PRE_LEN  (8U)
#define DSP2_MIDDLE3_AWB2_YTH3_PRE_MSK  (((1U << DSP2_MIDDLE3_AWB2_YTH3_PRE_LEN) - 1) << DSP2_MIDDLE3_AWB2_YTH3_PRE_POS)
#define DSP2_MIDDLE3_AWB2_YTH3_PRE_UMSK (~(((1U << DSP2_MIDDLE3_AWB2_YTH3_PRE_LEN) - 1) << DSP2_MIDDLE3_AWB2_YTH3_PRE_POS))
#define DSP2_MIDDLE3_AWB2_YTH4_PRE      DSP2_MIDDLE3_AWB2_YTH4_PRE
#define DSP2_MIDDLE3_AWB2_YTH4_PRE_POS  (24U)
#define DSP2_MIDDLE3_AWB2_YTH4_PRE_LEN  (8U)
#define DSP2_MIDDLE3_AWB2_YTH4_PRE_MSK  (((1U << DSP2_MIDDLE3_AWB2_YTH4_PRE_LEN) - 1) << DSP2_MIDDLE3_AWB2_YTH4_PRE_POS)
#define DSP2_MIDDLE3_AWB2_YTH4_PRE_UMSK (~(((1U << DSP2_MIDDLE3_AWB2_YTH4_PRE_LEN) - 1) << DSP2_MIDDLE3_AWB2_YTH4_PRE_POS))

/* 0x520 : awb2_sta_l1 */
#define DSP2_MIDDLE3_AWB2_STA_L1_OFFSET     (0x520)
#define DSP2_MIDDLE3_AWB2_YWEIGHT2_PRE      DSP2_MIDDLE3_AWB2_YWEIGHT2_PRE
#define DSP2_MIDDLE3_AWB2_YWEIGHT2_PRE_POS  (0U)
#define DSP2_MIDDLE3_AWB2_YWEIGHT2_PRE_LEN  (8U)
#define DSP2_MIDDLE3_AWB2_YWEIGHT2_PRE_MSK  (((1U << DSP2_MIDDLE3_AWB2_YWEIGHT2_PRE_LEN) - 1) << DSP2_MIDDLE3_AWB2_YWEIGHT2_PRE_POS)
#define DSP2_MIDDLE3_AWB2_YWEIGHT2_PRE_UMSK (~(((1U << DSP2_MIDDLE3_AWB2_YWEIGHT2_PRE_LEN) - 1) << DSP2_MIDDLE3_AWB2_YWEIGHT2_PRE_POS))
#define DSP2_MIDDLE3_AWB2_YWEIGHT3_PRE      DSP2_MIDDLE3_AWB2_YWEIGHT3_PRE
#define DSP2_MIDDLE3_AWB2_YWEIGHT3_PRE_POS  (8U)
#define DSP2_MIDDLE3_AWB2_YWEIGHT3_PRE_LEN  (8U)
#define DSP2_MIDDLE3_AWB2_YWEIGHT3_PRE_MSK  (((1U << DSP2_MIDDLE3_AWB2_YWEIGHT3_PRE_LEN) - 1) << DSP2_MIDDLE3_AWB2_YWEIGHT3_PRE_POS)
#define DSP2_MIDDLE3_AWB2_YWEIGHT3_PRE_UMSK (~(((1U << DSP2_MIDDLE3_AWB2_YWEIGHT3_PRE_LEN) - 1) << DSP2_MIDDLE3_AWB2_YWEIGHT3_PRE_POS))
#define DSP2_MIDDLE3_AWB2_YWEIGHT4_PRE      DSP2_MIDDLE3_AWB2_YWEIGHT4_PRE
#define DSP2_MIDDLE3_AWB2_YWEIGHT4_PRE_POS  (16U)
#define DSP2_MIDDLE3_AWB2_YWEIGHT4_PRE_LEN  (8U)
#define DSP2_MIDDLE3_AWB2_YWEIGHT4_PRE_MSK  (((1U << DSP2_MIDDLE3_AWB2_YWEIGHT4_PRE_LEN) - 1) << DSP2_MIDDLE3_AWB2_YWEIGHT4_PRE_POS)
#define DSP2_MIDDLE3_AWB2_YWEIGHT4_PRE_UMSK (~(((1U << DSP2_MIDDLE3_AWB2_YWEIGHT4_PRE_LEN) - 1) << DSP2_MIDDLE3_AWB2_YWEIGHT4_PRE_POS))
#define DSP2_MIDDLE3_AWB2_YTH0_PRE          DSP2_MIDDLE3_AWB2_YTH0_PRE
#define DSP2_MIDDLE3_AWB2_YTH0_PRE_POS      (24U)
#define DSP2_MIDDLE3_AWB2_YTH0_PRE_LEN      (8U)
#define DSP2_MIDDLE3_AWB2_YTH0_PRE_MSK      (((1U << DSP2_MIDDLE3_AWB2_YTH0_PRE_LEN) - 1) << DSP2_MIDDLE3_AWB2_YTH0_PRE_POS)
#define DSP2_MIDDLE3_AWB2_YTH0_PRE_UMSK     (~(((1U << DSP2_MIDDLE3_AWB2_YTH0_PRE_LEN) - 1) << DSP2_MIDDLE3_AWB2_YTH0_PRE_POS))

/* 0x524 : awb2_sta_l2 */
#define DSP2_MIDDLE3_AWB2_STA_L2_OFFSET     (0x524)
#define DSP2_MIDDLE3_AWB2_YSLOPE4_PRE       DSP2_MIDDLE3_AWB2_YSLOPE4_PRE
#define DSP2_MIDDLE3_AWB2_YSLOPE4_PRE_POS   (0U)
#define DSP2_MIDDLE3_AWB2_YSLOPE4_PRE_LEN   (9U)
#define DSP2_MIDDLE3_AWB2_YSLOPE4_PRE_MSK   (((1U << DSP2_MIDDLE3_AWB2_YSLOPE4_PRE_LEN) - 1) << DSP2_MIDDLE3_AWB2_YSLOPE4_PRE_POS)
#define DSP2_MIDDLE3_AWB2_YSLOPE4_PRE_UMSK  (~(((1U << DSP2_MIDDLE3_AWB2_YSLOPE4_PRE_LEN) - 1) << DSP2_MIDDLE3_AWB2_YSLOPE4_PRE_POS))
#define DSP2_MIDDLE3_AWB2_YWEIGHT0_PRE      DSP2_MIDDLE3_AWB2_YWEIGHT0_PRE
#define DSP2_MIDDLE3_AWB2_YWEIGHT0_PRE_POS  (16U)
#define DSP2_MIDDLE3_AWB2_YWEIGHT0_PRE_LEN  (8U)
#define DSP2_MIDDLE3_AWB2_YWEIGHT0_PRE_MSK  (((1U << DSP2_MIDDLE3_AWB2_YWEIGHT0_PRE_LEN) - 1) << DSP2_MIDDLE3_AWB2_YWEIGHT0_PRE_POS)
#define DSP2_MIDDLE3_AWB2_YWEIGHT0_PRE_UMSK (~(((1U << DSP2_MIDDLE3_AWB2_YWEIGHT0_PRE_LEN) - 1) << DSP2_MIDDLE3_AWB2_YWEIGHT0_PRE_POS))
#define DSP2_MIDDLE3_AWB2_YWEIGHT1_PRE      DSP2_MIDDLE3_AWB2_YWEIGHT1_PRE
#define DSP2_MIDDLE3_AWB2_YWEIGHT1_PRE_POS  (24U)
#define DSP2_MIDDLE3_AWB2_YWEIGHT1_PRE_LEN  (8U)
#define DSP2_MIDDLE3_AWB2_YWEIGHT1_PRE_MSK  (((1U << DSP2_MIDDLE3_AWB2_YWEIGHT1_PRE_LEN) - 1) << DSP2_MIDDLE3_AWB2_YWEIGHT1_PRE_POS)
#define DSP2_MIDDLE3_AWB2_YWEIGHT1_PRE_UMSK (~(((1U << DSP2_MIDDLE3_AWB2_YWEIGHT1_PRE_LEN) - 1) << DSP2_MIDDLE3_AWB2_YWEIGHT1_PRE_POS))

