RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dsp2_middle3_reg.h
/* 0x528 : awb2_sta_l3 */
#define DSP2_MIDDLE3_AWB2_STA_L3_OFFSET    (0x528)
#define DSP2_MIDDLE3_AWB2_YSLOPE2_PRE      DSP2_MIDDLE3_AWB2_YSLOPE2_PRE
#define DSP2_MIDDLE3_AWB2_YSLOPE2_PRE_POS  (0U)
#define DSP2_MIDDLE3_AWB2_YSLOPE2_PRE_LEN  (9U)
#define DSP2_MIDDLE3_AWB2_YSLOPE2_PRE_MSK  (((1U << DSP2_MIDDLE3_AWB2_YSLOPE2_PRE_LEN) - 1) << DSP2_MIDDLE3_AWB2_YSLOPE2_PRE_POS)
#define DSP2_MIDDLE3_AWB2_YSLOPE2_PRE_UMSK (~(((1U << DSP2_MIDDLE3_AWB2_YSLOPE2_PRE_LEN) - 1) << DSP2_MIDDLE3_AWB2_YSLOPE2_PRE_POS))
#define DSP2_MIDDLE3_AWB2_YSLOPE3_PRE      DSP2_MIDDLE3_AWB2_YSLOPE3_PRE
#define DSP2_MIDDLE3_AWB2_YSLOPE3_PRE_POS  (16U)
#define DSP2_MIDDLE3_AWB2_YSLOPE3_PRE_LEN  (9U)
#define DSP2_MIDDLE3_AWB2_YSLOPE3_PRE_MSK  (((1U << DSP2_MIDDLE3_AWB2_YSLOPE3_PRE_LEN) - 1) << DSP2_MIDDLE3_AWB2_YSLOPE3_PRE_POS)
#define DSP2_MIDDLE3_AWB2_YSLOPE3_PRE_UMSK (~(((1U << DSP2_MIDDLE3_AWB2_YSLOPE3_PRE_LEN) - 1) << DSP2_MIDDLE3_AWB2_YSLOPE3_PRE_POS))

/* 0x52C : awb2_sta_l4 */
#define DSP2_MIDDLE3_AWB2_STA_L4_OFFSET    (0x52C)
#define DSP2_MIDDLE3_AWB2_YSLOPE0_PRE      DSP2_MIDDLE3_AWB2_YSLOPE0_PRE
#define DSP2_MIDDLE3_AWB2_YSLOPE0_PRE_POS  (0U)
#define DSP2_MIDDLE3_AWB2_YSLOPE0_PRE_LEN  (9U)
#define DSP2_MIDDLE3_AWB2_YSLOPE0_PRE_MSK  (((1U << DSP2_MIDDLE3_AWB2_YSLOPE0_PRE_LEN) - 1) << DSP2_MIDDLE3_AWB2_YSLOPE0_PRE_POS)
#define DSP2_MIDDLE3_AWB2_YSLOPE0_PRE_UMSK (~(((1U << DSP2_MIDDLE3_AWB2_YSLOPE0_PRE_LEN) - 1) << DSP2_MIDDLE3_AWB2_YSLOPE0_PRE_POS))
#define DSP2_MIDDLE3_AWB2_YSLOPE1_PRE      DSP2_MIDDLE3_AWB2_YSLOPE1_PRE
#define DSP2_MIDDLE3_AWB2_YSLOPE1_PRE_POS  (16U)
#define DSP2_MIDDLE3_AWB2_YSLOPE1_PRE_LEN  (9U)
#define DSP2_MIDDLE3_AWB2_YSLOPE1_PRE_MSK  (((1U << DSP2_MIDDLE3_AWB2_YSLOPE1_PRE_LEN) - 1) << DSP2_MIDDLE3_AWB2_YSLOPE1_PRE_POS)
#define DSP2_MIDDLE3_AWB2_YSLOPE1_PRE_UMSK (~(((1U << DSP2_MIDDLE3_AWB2_YSLOPE1_PRE_LEN) - 1) << DSP2_MIDDLE3_AWB2_YSLOPE1_PRE_POS))

/* 0x530 : awb2_sta_c0 */
#define DSP2_MIDDLE3_AWB2_STA_C0_OFFSET  (0x530)
#define DSP2_MIDDLE3_AWB2_UREG4_PRE      DSP2_MIDDLE3_AWB2_UREG4_PRE
#define DSP2_MIDDLE3_AWB2_UREG4_PRE_POS  (0U)
#define DSP2_MIDDLE3_AWB2_UREG4_PRE_LEN  (8U)
#define DSP2_MIDDLE3_AWB2_UREG4_PRE_MSK  (((1U << DSP2_MIDDLE3_AWB2_UREG4_PRE_LEN) - 1) << DSP2_MIDDLE3_AWB2_UREG4_PRE_POS)
#define DSP2_MIDDLE3_AWB2_UREG4_PRE_UMSK (~(((1U << DSP2_MIDDLE3_AWB2_UREG4_PRE_LEN) - 1) << DSP2_MIDDLE3_AWB2_UREG4_PRE_POS))
#define DSP2_MIDDLE3_AWB2_UREG5_PRE      DSP2_MIDDLE3_AWB2_UREG5_PRE
#define DSP2_MIDDLE3_AWB2_UREG5_PRE_POS  (8U)
#define DSP2_MIDDLE3_AWB2_UREG5_PRE_LEN  (8U)
#define DSP2_MIDDLE3_AWB2_UREG5_PRE_MSK  (((1U << DSP2_MIDDLE3_AWB2_UREG5_PRE_LEN) - 1) << DSP2_MIDDLE3_AWB2_UREG5_PRE_POS)
#define DSP2_MIDDLE3_AWB2_UREG5_PRE_UMSK (~(((1U << DSP2_MIDDLE3_AWB2_UREG5_PRE_LEN) - 1) << DSP2_MIDDLE3_AWB2_UREG5_PRE_POS))
#define DSP2_MIDDLE3_AWB2_UREG6_PRE      DSP2_MIDDLE3_AWB2_UREG6_PRE
#define DSP2_MIDDLE3_AWB2_UREG6_PRE_POS  (16U)
#define DSP2_MIDDLE3_AWB2_UREG6_PRE_LEN  (8U)
#define DSP2_MIDDLE3_AWB2_UREG6_PRE_MSK  (((1U << DSP2_MIDDLE3_AWB2_UREG6_PRE_LEN) - 1) << DSP2_MIDDLE3_AWB2_UREG6_PRE_POS)
#define DSP2_MIDDLE3_AWB2_UREG6_PRE_UMSK (~(((1U << DSP2_MIDDLE3_AWB2_UREG6_PRE_LEN) - 1) << DSP2_MIDDLE3_AWB2_UREG6_PRE_POS))
#define DSP2_MIDDLE3_AWB2_UREG7_PRE      DSP2_MIDDLE3_AWB2_UREG7_PRE
#define DSP2_MIDDLE3_AWB2_UREG7_PRE_POS  (24U)
#define DSP2_MIDDLE3_AWB2_UREG7_PRE_LEN  (8U)
#define DSP2_MIDDLE3_AWB2_UREG7_PRE_MSK  (((1U << DSP2_MIDDLE3_AWB2_UREG7_PRE_LEN) - 1) << DSP2_MIDDLE3_AWB2_UREG7_PRE_POS)
#define DSP2_MIDDLE3_AWB2_UREG7_PRE_UMSK (~(((1U << DSP2_MIDDLE3_AWB2_UREG7_PRE_LEN) - 1) << DSP2_MIDDLE3_AWB2_UREG7_PRE_POS))

/* 0x534 : awb2_sta_c1 */
#define DSP2_MIDDLE3_AWB2_STA_C1_OFFSET  (0x534)
#define DSP2_MIDDLE3_AWB2_UREG0_PRE      DSP2_MIDDLE3_AWB2_UREG0_PRE
#define DSP2_MIDDLE3_AWB2_UREG0_PRE_POS  (0U)
#define DSP2_MIDDLE3_AWB2_UREG0_PRE_LEN  (8U)
#define DSP2_MIDDLE3_AWB2_UREG0_PRE_MSK  (((1U << DSP2_MIDDLE3_AWB2_UREG0_PRE_LEN) - 1) << DSP2_MIDDLE3_AWB2_UREG0_PRE_POS)
#define DSP2_MIDDLE3_AWB2_UREG0_PRE_UMSK (~(((1U << DSP2_MIDDLE3_AWB2_UREG0_PRE_LEN) - 1) << DSP2_MIDDLE3_AWB2_UREG0_PRE_POS))
#define DSP2_MIDDLE3_AWB2_UREG1_PRE      DSP2_MIDDLE3_AWB2_UREG1_PRE
#define DSP2_MIDDLE3_AWB2_UREG1_PRE_POS  (8U)
#define DSP2_MIDDLE3_AWB2_UREG1_PRE_LEN  (8U)
#define DSP2_MIDDLE3_AWB2_UREG1_PRE_MSK  (((1U << DSP2_MIDDLE3_AWB2_UREG1_PRE_LEN) - 1) << DSP2_MIDDLE3_AWB2_UREG1_PRE_POS)
#define DSP2_MIDDLE3_AWB2_UREG1_PRE_UMSK (~(((1U << DSP2_MIDDLE3_AWB2_UREG1_PRE_LEN) - 1) << DSP2_MIDDLE3_AWB2_UREG1_PRE_POS))
#define DSP2_MIDDLE3_AWB2_UREG2_PRE      DSP2_MIDDLE3_AWB2_UREG2_PRE
#define DSP2_MIDDLE3_AWB2_UREG2_PRE_POS  (16U)
#define DSP2_MIDDLE3_AWB2_UREG2_PRE_LEN  (8U)
#define DSP2_MIDDLE3_AWB2_UREG2_PRE_MSK  (((1U << DSP2_MIDDLE3_AWB2_UREG2_PRE_LEN) - 1) << DSP2_MIDDLE3_AWB2_UREG2_PRE_POS)
#define DSP2_MIDDLE3_AWB2_UREG2_PRE_UMSK (~(((1U << DSP2_MIDDLE3_AWB2_UREG2_PRE_LEN) - 1) << DSP2_MIDDLE3_AWB2_UREG2_PRE_POS))
#define DSP2_MIDDLE3_AWB2_UREG3_PRE      DSP2_MIDDLE3_AWB2_UREG3_PRE
#define DSP2_MIDDLE3_AWB2_UREG3_PRE_POS  (24U)
#define DSP2_MIDDLE3_AWB2_UREG3_PRE_LEN  (8U)
#define DSP2_MIDDLE3_AWB2_UREG3_PRE_MSK  (((1U << DSP2_MIDDLE3_AWB2_UREG3_PRE_LEN) - 1) << DSP2_MIDDLE3_AWB2_UREG3_PRE_POS)
#define DSP2_MIDDLE3_AWB2_UREG3_PRE_UMSK (~(((1U << DSP2_MIDDLE3_AWB2_UREG3_PRE_LEN) - 1) << DSP2_MIDDLE3_AWB2_UREG3_PRE_POS))

/* 0x538 : awb2_sta_c2 */
#define DSP2_MIDDLE3_AWB2_STA_C2_OFFSET  (0x538)
#define DSP2_MIDDLE3_AWB2_VREG4_PRE      DSP2_MIDDLE3_AWB2_VREG4_PRE
#define DSP2_MIDDLE3_AWB2_VREG4_PRE_POS  (0U)
#define DSP2_MIDDLE3_AWB2_VREG4_PRE_LEN  (8U)
#define DSP2_MIDDLE3_AWB2_VREG4_PRE_MSK  (((1U << DSP2_MIDDLE3_AWB2_VREG4_PRE_LEN) - 1) << DSP2_MIDDLE3_AWB2_VREG4_PRE_POS)
#define DSP2_MIDDLE3_AWB2_VREG4_PRE_UMSK (~(((1U << DSP2_MIDDLE3_AWB2_VREG4_PRE_LEN) - 1) << DSP2_MIDDLE3_AWB2_VREG4_PRE_POS))
#define DSP2_MIDDLE3_AWB2_VREG5_PRE      DSP2_MIDDLE3_AWB2_VREG5_PRE
#define DSP2_MIDDLE3_AWB2_VREG5_PRE_POS  (8U)
#define DSP2_MIDDLE3_AWB2_VREG5_PRE_LEN  (8U)
#define DSP2_MIDDLE3_AWB2_VREG5_PRE_MSK  (((1U << DSP2_MIDDLE3_AWB2_VREG5_PRE_LEN) - 1) << DSP2_MIDDLE3_AWB2_VREG5_PRE_POS)
#define DSP2_MIDDLE3_AWB2_VREG5_PRE_UMSK (~(((1U << DSP2_MIDDLE3_AWB2_VREG5_PRE_LEN) - 1) << DSP2_MIDDLE3_AWB2_VREG5_PRE_POS))
#define DSP2_MIDDLE3_AWB2_VREG6_PRE      DSP2_MIDDLE3_AWB2_VREG6_PRE
#define DSP2_MIDDLE3_AWB2_VREG6_PRE_POS  (16U)
#define DSP2_MIDDLE3_AWB2_VREG6_PRE_LEN  (8U)
#define DSP2_MIDDLE3_AWB2_VREG6_PRE_MSK  (((1U << DSP2_MIDDLE3_AWB2_VREG6_PRE_LEN) - 1) << DSP2_MIDDLE3_AWB2_VREG6_PRE_POS)
#define DSP2_MIDDLE3_AWB2_VREG6_PRE_UMSK (~(((1U << DSP2_MIDDLE3_AWB2_VREG6_PRE_LEN) - 1) << DSP2_MIDDLE3_AWB2_VREG6_PRE_POS))
#define DSP2_MIDDLE3_AWB2_VREG7_PRE      DSP2_MIDDLE3_AWB2_VREG7_PRE
#define DSP2_MIDDLE3_AWB2_VREG7_PRE_POS  (24U)
#define DSP2_MIDDLE3_AWB2_VREG7_PRE_LEN  (8U)
#define DSP2_MIDDLE3_AWB2_VREG7_PRE_MSK  (((1U << DSP2_MIDDLE3_AWB2_VREG7_PRE_LEN) - 1) << DSP2_MIDDLE3_AWB2_VREG7_PRE_POS)
#define DSP2_MIDDLE3_AWB2_VREG7_PRE_UMSK (~(((1U << DSP2_MIDDLE3_AWB2_VREG7_PRE_LEN) - 1) << DSP2_MIDDLE3_AWB2_VREG7_PRE_POS))

/* 0x53C : awb2_sta_c3 */
#define DSP2_MIDDLE3_AWB2_STA_C3_OFFSET  (0x53C)
#define DSP2_MIDDLE3_AWB2_VREG0_PRE      DSP2_MIDDLE3_AWB2_VREG0_PRE
#define DSP2_MIDDLE3_AWB2_VREG0_PRE_POS  (0U)
#define DSP2_MIDDLE3_AWB2_VREG0_PRE_LEN  (8U)
#define DSP2_MIDDLE3_AWB2_VREG0_PRE_MSK  (((1U << DSP2_MIDDLE3_AWB2_VREG0_PRE_LEN) - 1) << DSP2_MIDDLE3_AWB2_VREG0_PRE_POS)
#define DSP2_MIDDLE3_AWB2_VREG0_PRE_UMSK (~(((1U << DSP2_MIDDLE3_AWB2_VREG0_PRE_LEN) - 1) << DSP2_MIDDLE3_AWB2_VREG0_PRE_POS))
#define DSP2_MIDDLE3_AWB2_VREG1_PRE      DSP2_MIDDLE3_AWB2_VREG1_PRE
#define DSP2_MIDDLE3_AWB2_VREG1_PRE_POS  (8U)
#define DSP2_MIDDLE3_AWB2_VREG1_PRE_LEN  (8U)
#define DSP2_MIDDLE3_AWB2_VREG1_PRE_MSK  (((1U << DSP2_MIDDLE3_AWB2_VREG1_PRE_LEN) - 1) << DSP2_MIDDLE3_AWB2_VREG1_PRE_POS)
#define DSP2_MIDDLE3_AWB2_VREG1_PRE_UMSK (~(((1U << DSP2_MIDDLE3_AWB2_VREG1_PRE_LEN) - 1) << DSP2_MIDDLE3_AWB2_VREG1_PRE_POS))
#define DSP2_MIDDLE3_AWB2_VREG2_PRE      DSP2_MIDDLE3_AWB2_VREG2_PRE
#define DSP2_MIDDLE3_AWB2_VREG2_PRE_POS  (16U)
#define DSP2_MIDDLE3_AWB2_VREG2_PRE_LEN  (8U)
#define DSP2_MIDDLE3_AWB2_VREG2_PRE_MSK  (((1U << DSP2_MIDDLE3_AWB2_VREG2_PRE_LEN) - 1) << DSP2_MIDDLE3_AWB2_VREG2_PRE_POS)
#define DSP2_MIDDLE3_AWB2_VREG2_PRE_UMSK (~(((1U << DSP2_MIDDLE3_AWB2_VREG2_PRE_LEN) - 1) << DSP2_MIDDLE3_AWB2_VREG2_PRE_POS))
#define DSP2_MIDDLE3_AWB2_VREG3_PRE      DSP2_MIDDLE3_AWB2_VREG3_PRE
#define DSP2_MIDDLE3_AWB2_VREG3_PRE_POS  (24U)
#define DSP2_MIDDLE3_AWB2_VREG3_PRE_LEN  (8U)
#define DSP2_MIDDLE3_AWB2_VREG3_PRE_MSK  (((1U << DSP2_MIDDLE3_AWB2_VREG3_PRE_LEN) - 1) << DSP2_MIDDLE3_AWB2_VREG3_PRE_POS)
#define DSP2_MIDDLE3_AWB2_VREG3_PRE_UMSK (~(((1U << DSP2_MIDDLE3_AWB2_VREG3_PRE_LEN) - 1) << DSP2_MIDDLE3_AWB2_VREG3_PRE_POS))

/* 0x540 : awb2_sta_c4 */
#define DSP2_MIDDLE3_AWB2_STA_C4_OFFSET (0x540)
#define DSP2_MIDDLE3_AWB2_CTH4_PRE      DSP2_MIDDLE3_AWB2_CTH4_PRE
#define DSP2_MIDDLE3_AWB2_CTH4_PRE_POS  (0U)
#define DSP2_MIDDLE3_AWB2_CTH4_PRE_LEN  (6U)
#define DSP2_MIDDLE3_AWB2_CTH4_PRE_MSK  (((1U << DSP2_MIDDLE3_AWB2_CTH4_PRE_LEN) - 1) << DSP2_MIDDLE3_AWB2_CTH4_PRE_POS)
#define DSP2_MIDDLE3_AWB2_CTH4_PRE_UMSK (~(((1U << DSP2_MIDDLE3_AWB2_CTH4_PRE_LEN) - 1) << DSP2_MIDDLE3_AWB2_CTH4_PRE_POS))
#define DSP2_MIDDLE3_AWB2_CTH5_PRE      DSP2_MIDDLE3_AWB2_CTH5_PRE
#define DSP2_MIDDLE3_AWB2_CTH5_PRE_POS  (8U)
#define DSP2_MIDDLE3_AWB2_CTH5_PRE_LEN  (6U)
#define DSP2_MIDDLE3_AWB2_CTH5_PRE_MSK  (((1U << DSP2_MIDDLE3_AWB2_CTH5_PRE_LEN) - 1) << DSP2_MIDDLE3_AWB2_CTH5_PRE_POS)
#define DSP2_MIDDLE3_AWB2_CTH5_PRE_UMSK (~(((1U << DSP2_MIDDLE3_AWB2_CTH5_PRE_LEN) - 1) << DSP2_MIDDLE3_AWB2_CTH5_PRE_POS))
#define DSP2_MIDDLE3_AWB2_CTH6_PRE      DSP2_MIDDLE3_AWB2_CTH6_PRE
#define DSP2_MIDDLE3_AWB2_CTH6_PRE_POS  (16U)
#define DSP2_MIDDLE3_AWB2_CTH6_PRE_LEN  (6U)
#define DSP2_MIDDLE3_AWB2_CTH6_PRE_MSK  (((1U << DSP2_MIDDLE3_AWB2_CTH6_PRE_LEN) - 1) << DSP2_MIDDLE3_AWB2_CTH6_PRE_POS)
#define DSP2_MIDDLE3_AWB2_CTH6_PRE_UMSK (~(((1U << DSP2_MIDDLE3_AWB2_CTH6_PRE_LEN) - 1) << DSP2_MIDDLE3_AWB2_CTH6_PRE_POS))
#define DSP2_MIDDLE3_AWB2_CTH7_PRE      DSP2_MIDDLE3_AWB2_CTH7_PRE
#define DSP2_MIDDLE3_AWB2_CTH7_PRE_POS  (24U)
#define DSP2_MIDDLE3_AWB2_CTH7_PRE_LEN  (6U)
#define DSP2_MIDDLE3_AWB2_CTH7_PRE_MSK  (((1U << DSP2_MIDDLE3_AWB2_CTH7_PRE_LEN) - 1) << DSP2_MIDDLE3_AWB2_CTH7_PRE_POS)
#define DSP2_MIDDLE3_AWB2_CTH7_PRE_UMSK (~(((1U << DSP2_MIDDLE3_AWB2_CTH7_PRE_LEN) - 1) << DSP2_MIDDLE3_AWB2_CTH7_PRE_POS))

