RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dsp2_middle3_reg.h
/* 0x544 : awb2_sta_c5 */
#define DSP2_MIDDLE3_AWB2_STA_C5_OFFSET (0x544)
#define DSP2_MIDDLE3_AWB2_CTH0_PRE      DSP2_MIDDLE3_AWB2_CTH0_PRE
#define DSP2_MIDDLE3_AWB2_CTH0_PRE_POS  (0U)
#define DSP2_MIDDLE3_AWB2_CTH0_PRE_LEN  (6U)
#define DSP2_MIDDLE3_AWB2_CTH0_PRE_MSK  (((1U << DSP2_MIDDLE3_AWB2_CTH0_PRE_LEN) - 1) << DSP2_MIDDLE3_AWB2_CTH0_PRE_POS)
#define DSP2_MIDDLE3_AWB2_CTH0_PRE_UMSK (~(((1U << DSP2_MIDDLE3_AWB2_CTH0_PRE_LEN) - 1) << DSP2_MIDDLE3_AWB2_CTH0_PRE_POS))
#define DSP2_MIDDLE3_AWB2_CTH1_PRE      DSP2_MIDDLE3_AWB2_CTH1_PRE
#define DSP2_MIDDLE3_AWB2_CTH1_PRE_POS  (8U)
#define DSP2_MIDDLE3_AWB2_CTH1_PRE_LEN  (6U)
#define DSP2_MIDDLE3_AWB2_CTH1_PRE_MSK  (((1U << DSP2_MIDDLE3_AWB2_CTH1_PRE_LEN) - 1) << DSP2_MIDDLE3_AWB2_CTH1_PRE_POS)
#define DSP2_MIDDLE3_AWB2_CTH1_PRE_UMSK (~(((1U << DSP2_MIDDLE3_AWB2_CTH1_PRE_LEN) - 1) << DSP2_MIDDLE3_AWB2_CTH1_PRE_POS))
#define DSP2_MIDDLE3_AWB2_CTH2_PRE      DSP2_MIDDLE3_AWB2_CTH2_PRE
#define DSP2_MIDDLE3_AWB2_CTH2_PRE_POS  (16U)
#define DSP2_MIDDLE3_AWB2_CTH2_PRE_LEN  (6U)
#define DSP2_MIDDLE3_AWB2_CTH2_PRE_MSK  (((1U << DSP2_MIDDLE3_AWB2_CTH2_PRE_LEN) - 1) << DSP2_MIDDLE3_AWB2_CTH2_PRE_POS)
#define DSP2_MIDDLE3_AWB2_CTH2_PRE_UMSK (~(((1U << DSP2_MIDDLE3_AWB2_CTH2_PRE_LEN) - 1) << DSP2_MIDDLE3_AWB2_CTH2_PRE_POS))
#define DSP2_MIDDLE3_AWB2_CTH3_PRE      DSP2_MIDDLE3_AWB2_CTH3_PRE
#define DSP2_MIDDLE3_AWB2_CTH3_PRE_POS  (24U)
#define DSP2_MIDDLE3_AWB2_CTH3_PRE_LEN  (6U)
#define DSP2_MIDDLE3_AWB2_CTH3_PRE_MSK  (((1U << DSP2_MIDDLE3_AWB2_CTH3_PRE_LEN) - 1) << DSP2_MIDDLE3_AWB2_CTH3_PRE_POS)
#define DSP2_MIDDLE3_AWB2_CTH3_PRE_UMSK (~(((1U << DSP2_MIDDLE3_AWB2_CTH3_PRE_LEN) - 1) << DSP2_MIDDLE3_AWB2_CTH3_PRE_POS))

/* 0x548 : awb2_sta_c6 */
#define DSP2_MIDDLE3_AWB2_STA_C6_OFFSET    (0x548)
#define DSP2_MIDDLE3_AWB2_CSLOPE4_PRE      DSP2_MIDDLE3_AWB2_CSLOPE4_PRE
#define DSP2_MIDDLE3_AWB2_CSLOPE4_PRE_POS  (0U)
#define DSP2_MIDDLE3_AWB2_CSLOPE4_PRE_LEN  (8U)
#define DSP2_MIDDLE3_AWB2_CSLOPE4_PRE_MSK  (((1U << DSP2_MIDDLE3_AWB2_CSLOPE4_PRE_LEN) - 1) << DSP2_MIDDLE3_AWB2_CSLOPE4_PRE_POS)
#define DSP2_MIDDLE3_AWB2_CSLOPE4_PRE_UMSK (~(((1U << DSP2_MIDDLE3_AWB2_CSLOPE4_PRE_LEN) - 1) << DSP2_MIDDLE3_AWB2_CSLOPE4_PRE_POS))
#define DSP2_MIDDLE3_AWB2_CSLOPE5_PRE      DSP2_MIDDLE3_AWB2_CSLOPE5_PRE
#define DSP2_MIDDLE3_AWB2_CSLOPE5_PRE_POS  (8U)
#define DSP2_MIDDLE3_AWB2_CSLOPE5_PRE_LEN  (8U)
#define DSP2_MIDDLE3_AWB2_CSLOPE5_PRE_MSK  (((1U << DSP2_MIDDLE3_AWB2_CSLOPE5_PRE_LEN) - 1) << DSP2_MIDDLE3_AWB2_CSLOPE5_PRE_POS)
#define DSP2_MIDDLE3_AWB2_CSLOPE5_PRE_UMSK (~(((1U << DSP2_MIDDLE3_AWB2_CSLOPE5_PRE_LEN) - 1) << DSP2_MIDDLE3_AWB2_CSLOPE5_PRE_POS))
#define DSP2_MIDDLE3_AWB2_CSLOPE6_PRE      DSP2_MIDDLE3_AWB2_CSLOPE6_PRE
#define DSP2_MIDDLE3_AWB2_CSLOPE6_PRE_POS  (16U)
#define DSP2_MIDDLE3_AWB2_CSLOPE6_PRE_LEN  (8U)
#define DSP2_MIDDLE3_AWB2_CSLOPE6_PRE_MSK  (((1U << DSP2_MIDDLE3_AWB2_CSLOPE6_PRE_LEN) - 1) << DSP2_MIDDLE3_AWB2_CSLOPE6_PRE_POS)
#define DSP2_MIDDLE3_AWB2_CSLOPE6_PRE_UMSK (~(((1U << DSP2_MIDDLE3_AWB2_CSLOPE6_PRE_LEN) - 1) << DSP2_MIDDLE3_AWB2_CSLOPE6_PRE_POS))
#define DSP2_MIDDLE3_AWB2_CSLOPE7_PRE      DSP2_MIDDLE3_AWB2_CSLOPE7_PRE
#define DSP2_MIDDLE3_AWB2_CSLOPE7_PRE_POS  (24U)
#define DSP2_MIDDLE3_AWB2_CSLOPE7_PRE_LEN  (8U)
#define DSP2_MIDDLE3_AWB2_CSLOPE7_PRE_MSK  (((1U << DSP2_MIDDLE3_AWB2_CSLOPE7_PRE_LEN) - 1) << DSP2_MIDDLE3_AWB2_CSLOPE7_PRE_POS)
#define DSP2_MIDDLE3_AWB2_CSLOPE7_PRE_UMSK (~(((1U << DSP2_MIDDLE3_AWB2_CSLOPE7_PRE_LEN) - 1) << DSP2_MIDDLE3_AWB2_CSLOPE7_PRE_POS))

/* 0x54C : awb2_sta_c7 */
#define DSP2_MIDDLE3_AWB2_STA_C7_OFFSET    (0x54C)
#define DSP2_MIDDLE3_AWB2_CSLOPE0_PRE      DSP2_MIDDLE3_AWB2_CSLOPE0_PRE
#define DSP2_MIDDLE3_AWB2_CSLOPE0_PRE_POS  (0U)
#define DSP2_MIDDLE3_AWB2_CSLOPE0_PRE_LEN  (8U)
#define DSP2_MIDDLE3_AWB2_CSLOPE0_PRE_MSK  (((1U << DSP2_MIDDLE3_AWB2_CSLOPE0_PRE_LEN) - 1) << DSP2_MIDDLE3_AWB2_CSLOPE0_PRE_POS)
#define DSP2_MIDDLE3_AWB2_CSLOPE0_PRE_UMSK (~(((1U << DSP2_MIDDLE3_AWB2_CSLOPE0_PRE_LEN) - 1) << DSP2_MIDDLE3_AWB2_CSLOPE0_PRE_POS))
#define DSP2_MIDDLE3_AWB2_CSLOPE1_PRE      DSP2_MIDDLE3_AWB2_CSLOPE1_PRE
#define DSP2_MIDDLE3_AWB2_CSLOPE1_PRE_POS  (8U)
#define DSP2_MIDDLE3_AWB2_CSLOPE1_PRE_LEN  (8U)
#define DSP2_MIDDLE3_AWB2_CSLOPE1_PRE_MSK  (((1U << DSP2_MIDDLE3_AWB2_CSLOPE1_PRE_LEN) - 1) << DSP2_MIDDLE3_AWB2_CSLOPE1_PRE_POS)
#define DSP2_MIDDLE3_AWB2_CSLOPE1_PRE_UMSK (~(((1U << DSP2_MIDDLE3_AWB2_CSLOPE1_PRE_LEN) - 1) << DSP2_MIDDLE3_AWB2_CSLOPE1_PRE_POS))
#define DSP2_MIDDLE3_AWB2_CSLOPE2_PRE      DSP2_MIDDLE3_AWB2_CSLOPE2_PRE
#define DSP2_MIDDLE3_AWB2_CSLOPE2_PRE_POS  (16U)
#define DSP2_MIDDLE3_AWB2_CSLOPE2_PRE_LEN  (8U)
#define DSP2_MIDDLE3_AWB2_CSLOPE2_PRE_MSK  (((1U << DSP2_MIDDLE3_AWB2_CSLOPE2_PRE_LEN) - 1) << DSP2_MIDDLE3_AWB2_CSLOPE2_PRE_POS)
#define DSP2_MIDDLE3_AWB2_CSLOPE2_PRE_UMSK (~(((1U << DSP2_MIDDLE3_AWB2_CSLOPE2_PRE_LEN) - 1) << DSP2_MIDDLE3_AWB2_CSLOPE2_PRE_POS))
#define DSP2_MIDDLE3_AWB2_CSLOPE3_PRE      DSP2_MIDDLE3_AWB2_CSLOPE3_PRE
#define DSP2_MIDDLE3_AWB2_CSLOPE3_PRE_POS  (24U)
#define DSP2_MIDDLE3_AWB2_CSLOPE3_PRE_LEN  (8U)
#define DSP2_MIDDLE3_AWB2_CSLOPE3_PRE_MSK  (((1U << DSP2_MIDDLE3_AWB2_CSLOPE3_PRE_LEN) - 1) << DSP2_MIDDLE3_AWB2_CSLOPE3_PRE_POS)
#define DSP2_MIDDLE3_AWB2_CSLOPE3_PRE_UMSK (~(((1U << DSP2_MIDDLE3_AWB2_CSLOPE3_PRE_LEN) - 1) << DSP2_MIDDLE3_AWB2_CSLOPE3_PRE_POS))

/* 0x550 : awb2_sta_r0 */
#define DSP2_MIDDLE3_AWB2_STA_R0_OFFSET (0x550)
#define DSP2_MIDDLE3_AWB2_G_AVG0_R      DSP2_MIDDLE3_AWB2_G_AVG0_R
#define DSP2_MIDDLE3_AWB2_G_AVG0_R_POS  (0U)
#define DSP2_MIDDLE3_AWB2_G_AVG0_R_LEN  (12U)
#define DSP2_MIDDLE3_AWB2_G_AVG0_R_MSK  (((1U << DSP2_MIDDLE3_AWB2_G_AVG0_R_LEN) - 1) << DSP2_MIDDLE3_AWB2_G_AVG0_R_POS)
#define DSP2_MIDDLE3_AWB2_G_AVG0_R_UMSK (~(((1U << DSP2_MIDDLE3_AWB2_G_AVG0_R_LEN) - 1) << DSP2_MIDDLE3_AWB2_G_AVG0_R_POS))
#define DSP2_MIDDLE3_AWB2_R_AVG0_R      DSP2_MIDDLE3_AWB2_R_AVG0_R
#define DSP2_MIDDLE3_AWB2_R_AVG0_R_POS  (16U)
#define DSP2_MIDDLE3_AWB2_R_AVG0_R_LEN  (12U)
#define DSP2_MIDDLE3_AWB2_R_AVG0_R_MSK  (((1U << DSP2_MIDDLE3_AWB2_R_AVG0_R_LEN) - 1) << DSP2_MIDDLE3_AWB2_R_AVG0_R_POS)
#define DSP2_MIDDLE3_AWB2_R_AVG0_R_UMSK (~(((1U << DSP2_MIDDLE3_AWB2_R_AVG0_R_LEN) - 1) << DSP2_MIDDLE3_AWB2_R_AVG0_R_POS))

/* 0x554 : awb2_sta_r1 */
#define DSP2_MIDDLE3_AWB2_STA_R1_OFFSET       (0x554)
#define DSP2_MIDDLE3_AWB2_WHITE_RATIO0_R      DSP2_MIDDLE3_AWB2_WHITE_RATIO0_R
#define DSP2_MIDDLE3_AWB2_WHITE_RATIO0_R_POS  (0U)
#define DSP2_MIDDLE3_AWB2_WHITE_RATIO0_R_LEN  (15U)
#define DSP2_MIDDLE3_AWB2_WHITE_RATIO0_R_MSK  (((1U << DSP2_MIDDLE3_AWB2_WHITE_RATIO0_R_LEN) - 1) << DSP2_MIDDLE3_AWB2_WHITE_RATIO0_R_POS)
#define DSP2_MIDDLE3_AWB2_WHITE_RATIO0_R_UMSK (~(((1U << DSP2_MIDDLE3_AWB2_WHITE_RATIO0_R_LEN) - 1) << DSP2_MIDDLE3_AWB2_WHITE_RATIO0_R_POS))
#define DSP2_MIDDLE3_AWB2_B_AVG0_R            DSP2_MIDDLE3_AWB2_B_AVG0_R
#define DSP2_MIDDLE3_AWB2_B_AVG0_R_POS        (16U)
#define DSP2_MIDDLE3_AWB2_B_AVG0_R_LEN        (12U)
#define DSP2_MIDDLE3_AWB2_B_AVG0_R_MSK        (((1U << DSP2_MIDDLE3_AWB2_B_AVG0_R_LEN) - 1) << DSP2_MIDDLE3_AWB2_B_AVG0_R_POS)
#define DSP2_MIDDLE3_AWB2_B_AVG0_R_UMSK       (~(((1U << DSP2_MIDDLE3_AWB2_B_AVG0_R_LEN) - 1) << DSP2_MIDDLE3_AWB2_B_AVG0_R_POS))

/* 0x558 : awb2_sta_r2 */
#define DSP2_MIDDLE3_AWB2_STA_R2_OFFSET (0x558)
#define DSP2_MIDDLE3_AWB2_G_AVG1_R      DSP2_MIDDLE3_AWB2_G_AVG1_R
#define DSP2_MIDDLE3_AWB2_G_AVG1_R_POS  (0U)
#define DSP2_MIDDLE3_AWB2_G_AVG1_R_LEN  (12U)
#define DSP2_MIDDLE3_AWB2_G_AVG1_R_MSK  (((1U << DSP2_MIDDLE3_AWB2_G_AVG1_R_LEN) - 1) << DSP2_MIDDLE3_AWB2_G_AVG1_R_POS)
#define DSP2_MIDDLE3_AWB2_G_AVG1_R_UMSK (~(((1U << DSP2_MIDDLE3_AWB2_G_AVG1_R_LEN) - 1) << DSP2_MIDDLE3_AWB2_G_AVG1_R_POS))
#define DSP2_MIDDLE3_AWB2_R_AVG1_R      DSP2_MIDDLE3_AWB2_R_AVG1_R
#define DSP2_MIDDLE3_AWB2_R_AVG1_R_POS  (16U)
#define DSP2_MIDDLE3_AWB2_R_AVG1_R_LEN  (12U)
#define DSP2_MIDDLE3_AWB2_R_AVG1_R_MSK  (((1U << DSP2_MIDDLE3_AWB2_R_AVG1_R_LEN) - 1) << DSP2_MIDDLE3_AWB2_R_AVG1_R_POS)
#define DSP2_MIDDLE3_AWB2_R_AVG1_R_UMSK (~(((1U << DSP2_MIDDLE3_AWB2_R_AVG1_R_LEN) - 1) << DSP2_MIDDLE3_AWB2_R_AVG1_R_POS))

/* 0x55C : awb2_sta_r3 */
#define DSP2_MIDDLE3_AWB2_STA_R3_OFFSET       (0x55C)
#define DSP2_MIDDLE3_AWB2_WHITE_RATIO1_R      DSP2_MIDDLE3_AWB2_WHITE_RATIO1_R
#define DSP2_MIDDLE3_AWB2_WHITE_RATIO1_R_POS  (0U)
#define DSP2_MIDDLE3_AWB2_WHITE_RATIO1_R_LEN  (15U)
#define DSP2_MIDDLE3_AWB2_WHITE_RATIO1_R_MSK  (((1U << DSP2_MIDDLE3_AWB2_WHITE_RATIO1_R_LEN) - 1) << DSP2_MIDDLE3_AWB2_WHITE_RATIO1_R_POS)
#define DSP2_MIDDLE3_AWB2_WHITE_RATIO1_R_UMSK (~(((1U << DSP2_MIDDLE3_AWB2_WHITE_RATIO1_R_LEN) - 1) << DSP2_MIDDLE3_AWB2_WHITE_RATIO1_R_POS))
#define DSP2_MIDDLE3_AWB2_B_AVG1_R            DSP2_MIDDLE3_AWB2_B_AVG1_R
#define DSP2_MIDDLE3_AWB2_B_AVG1_R_POS        (16U)
#define DSP2_MIDDLE3_AWB2_B_AVG1_R_LEN        (12U)
#define DSP2_MIDDLE3_AWB2_B_AVG1_R_MSK        (((1U << DSP2_MIDDLE3_AWB2_B_AVG1_R_LEN) - 1) << DSP2_MIDDLE3_AWB2_B_AVG1_R_POS)
#define DSP2_MIDDLE3_AWB2_B_AVG1_R_UMSK       (~(((1U << DSP2_MIDDLE3_AWB2_B_AVG1_R_LEN) - 1) << DSP2_MIDDLE3_AWB2_B_AVG1_R_POS))

