RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dsp2_middle3_reg.h
/* 0x560 : awb2_sta_r4 */
#define DSP2_MIDDLE3_AWB2_STA_R4_OFFSET       (0x560)
#define DSP2_MIDDLE3_AWB2_WHITER_SUMH0_R      DSP2_MIDDLE3_AWB2_WHITER_SUMH0_R
#define DSP2_MIDDLE3_AWB2_WHITER_SUMH0_R_POS  (0U)
#define DSP2_MIDDLE3_AWB2_WHITER_SUMH0_R_LEN  (32U)
#define DSP2_MIDDLE3_AWB2_WHITER_SUMH0_R_MSK  (((1U << DSP2_MIDDLE3_AWB2_WHITER_SUMH0_R_LEN) - 1) << DSP2_MIDDLE3_AWB2_WHITER_SUMH0_R_POS)
#define DSP2_MIDDLE3_AWB2_WHITER_SUMH0_R_UMSK (~(((1U << DSP2_MIDDLE3_AWB2_WHITER_SUMH0_R_LEN) - 1) << DSP2_MIDDLE3_AWB2_WHITER_SUMH0_R_POS))

/* 0x564 : awb2_sta_r5 */
#define DSP2_MIDDLE3_AWB2_STA_R5_OFFSET       (0x564)
#define DSP2_MIDDLE3_AWB2_WHITER_SUML1_R      DSP2_MIDDLE3_AWB2_WHITER_SUML1_R
#define DSP2_MIDDLE3_AWB2_WHITER_SUML1_R_POS  (0U)
#define DSP2_MIDDLE3_AWB2_WHITER_SUML1_R_LEN  (9U)
#define DSP2_MIDDLE3_AWB2_WHITER_SUML1_R_MSK  (((1U << DSP2_MIDDLE3_AWB2_WHITER_SUML1_R_LEN) - 1) << DSP2_MIDDLE3_AWB2_WHITER_SUML1_R_POS)
#define DSP2_MIDDLE3_AWB2_WHITER_SUML1_R_UMSK (~(((1U << DSP2_MIDDLE3_AWB2_WHITER_SUML1_R_LEN) - 1) << DSP2_MIDDLE3_AWB2_WHITER_SUML1_R_POS))
#define DSP2_MIDDLE3_AWB2_WHITER_SUML0_R      DSP2_MIDDLE3_AWB2_WHITER_SUML0_R
#define DSP2_MIDDLE3_AWB2_WHITER_SUML0_R_POS  (16U)
#define DSP2_MIDDLE3_AWB2_WHITER_SUML0_R_LEN  (9U)
#define DSP2_MIDDLE3_AWB2_WHITER_SUML0_R_MSK  (((1U << DSP2_MIDDLE3_AWB2_WHITER_SUML0_R_LEN) - 1) << DSP2_MIDDLE3_AWB2_WHITER_SUML0_R_POS)
#define DSP2_MIDDLE3_AWB2_WHITER_SUML0_R_UMSK (~(((1U << DSP2_MIDDLE3_AWB2_WHITER_SUML0_R_LEN) - 1) << DSP2_MIDDLE3_AWB2_WHITER_SUML0_R_POS))

/* 0x568 : awb2_sta_r6 */
#define DSP2_MIDDLE3_AWB2_STA_R6_OFFSET       (0x568)
#define DSP2_MIDDLE3_AWB2_WHITER_SUMH1_R      DSP2_MIDDLE3_AWB2_WHITER_SUMH1_R
#define DSP2_MIDDLE3_AWB2_WHITER_SUMH1_R_POS  (0U)
#define DSP2_MIDDLE3_AWB2_WHITER_SUMH1_R_LEN  (32U)
#define DSP2_MIDDLE3_AWB2_WHITER_SUMH1_R_MSK  (((1U << DSP2_MIDDLE3_AWB2_WHITER_SUMH1_R_LEN) - 1) << DSP2_MIDDLE3_AWB2_WHITER_SUMH1_R_POS)
#define DSP2_MIDDLE3_AWB2_WHITER_SUMH1_R_UMSK (~(((1U << DSP2_MIDDLE3_AWB2_WHITER_SUMH1_R_LEN) - 1) << DSP2_MIDDLE3_AWB2_WHITER_SUMH1_R_POS))

/* 0x56C : awb2_sta_r7 */
#define DSP2_MIDDLE3_AWB2_STA_R7_OFFSET       (0x56C)
#define DSP2_MIDDLE3_AWB2_WHITEG_SUMH0_R      DSP2_MIDDLE3_AWB2_WHITEG_SUMH0_R
#define DSP2_MIDDLE3_AWB2_WHITEG_SUMH0_R_POS  (0U)
#define DSP2_MIDDLE3_AWB2_WHITEG_SUMH0_R_LEN  (32U)
#define DSP2_MIDDLE3_AWB2_WHITEG_SUMH0_R_MSK  (((1U << DSP2_MIDDLE3_AWB2_WHITEG_SUMH0_R_LEN) - 1) << DSP2_MIDDLE3_AWB2_WHITEG_SUMH0_R_POS)
#define DSP2_MIDDLE3_AWB2_WHITEG_SUMH0_R_UMSK (~(((1U << DSP2_MIDDLE3_AWB2_WHITEG_SUMH0_R_LEN) - 1) << DSP2_MIDDLE3_AWB2_WHITEG_SUMH0_R_POS))

/* 0x570 : awb2_sta_r8 */
#define DSP2_MIDDLE3_AWB2_STA_R8_OFFSET       (0x570)
#define DSP2_MIDDLE3_AWB2_WHITEG_SUML1_R      DSP2_MIDDLE3_AWB2_WHITEG_SUML1_R
#define DSP2_MIDDLE3_AWB2_WHITEG_SUML1_R_POS  (0U)
#define DSP2_MIDDLE3_AWB2_WHITEG_SUML1_R_LEN  (9U)
#define DSP2_MIDDLE3_AWB2_WHITEG_SUML1_R_MSK  (((1U << DSP2_MIDDLE3_AWB2_WHITEG_SUML1_R_LEN) - 1) << DSP2_MIDDLE3_AWB2_WHITEG_SUML1_R_POS)
#define DSP2_MIDDLE3_AWB2_WHITEG_SUML1_R_UMSK (~(((1U << DSP2_MIDDLE3_AWB2_WHITEG_SUML1_R_LEN) - 1) << DSP2_MIDDLE3_AWB2_WHITEG_SUML1_R_POS))
#define DSP2_MIDDLE3_AWB2_WHITEG_SUML0_R      DSP2_MIDDLE3_AWB2_WHITEG_SUML0_R
#define DSP2_MIDDLE3_AWB2_WHITEG_SUML0_R_POS  (16U)
#define DSP2_MIDDLE3_AWB2_WHITEG_SUML0_R_LEN  (9U)
#define DSP2_MIDDLE3_AWB2_WHITEG_SUML0_R_MSK  (((1U << DSP2_MIDDLE3_AWB2_WHITEG_SUML0_R_LEN) - 1) << DSP2_MIDDLE3_AWB2_WHITEG_SUML0_R_POS)
#define DSP2_MIDDLE3_AWB2_WHITEG_SUML0_R_UMSK (~(((1U << DSP2_MIDDLE3_AWB2_WHITEG_SUML0_R_LEN) - 1) << DSP2_MIDDLE3_AWB2_WHITEG_SUML0_R_POS))

/* 0x574 : awb2_sta_r9 */
#define DSP2_MIDDLE3_AWB2_STA_R9_OFFSET       (0x574)
#define DSP2_MIDDLE3_AWB2_WHITEG_SUMH1_R      DSP2_MIDDLE3_AWB2_WHITEG_SUMH1_R
#define DSP2_MIDDLE3_AWB2_WHITEG_SUMH1_R_POS  (0U)
#define DSP2_MIDDLE3_AWB2_WHITEG_SUMH1_R_LEN  (32U)
#define DSP2_MIDDLE3_AWB2_WHITEG_SUMH1_R_MSK  (((1U << DSP2_MIDDLE3_AWB2_WHITEG_SUMH1_R_LEN) - 1) << DSP2_MIDDLE3_AWB2_WHITEG_SUMH1_R_POS)
#define DSP2_MIDDLE3_AWB2_WHITEG_SUMH1_R_UMSK (~(((1U << DSP2_MIDDLE3_AWB2_WHITEG_SUMH1_R_LEN) - 1) << DSP2_MIDDLE3_AWB2_WHITEG_SUMH1_R_POS))

/* 0x578 : awb2_sta_ra */
#define DSP2_MIDDLE3_AWB2_STA_RA_OFFSET       (0x578)
#define DSP2_MIDDLE3_AWB2_WHITEB_SUMH0_R      DSP2_MIDDLE3_AWB2_WHITEB_SUMH0_R
#define DSP2_MIDDLE3_AWB2_WHITEB_SUMH0_R_POS  (0U)
#define DSP2_MIDDLE3_AWB2_WHITEB_SUMH0_R_LEN  (32U)
#define DSP2_MIDDLE3_AWB2_WHITEB_SUMH0_R_MSK  (((1U << DSP2_MIDDLE3_AWB2_WHITEB_SUMH0_R_LEN) - 1) << DSP2_MIDDLE3_AWB2_WHITEB_SUMH0_R_POS)
#define DSP2_MIDDLE3_AWB2_WHITEB_SUMH0_R_UMSK (~(((1U << DSP2_MIDDLE3_AWB2_WHITEB_SUMH0_R_LEN) - 1) << DSP2_MIDDLE3_AWB2_WHITEB_SUMH0_R_POS))

/* 0x57C : awb2_sta_rb */
#define DSP2_MIDDLE3_AWB2_STA_RB_OFFSET       (0x57C)
#define DSP2_MIDDLE3_AWB2_WHITEB_SUML1_R      DSP2_MIDDLE3_AWB2_WHITEB_SUML1_R
#define DSP2_MIDDLE3_AWB2_WHITEB_SUML1_R_POS  (0U)
#define DSP2_MIDDLE3_AWB2_WHITEB_SUML1_R_LEN  (9U)
#define DSP2_MIDDLE3_AWB2_WHITEB_SUML1_R_MSK  (((1U << DSP2_MIDDLE3_AWB2_WHITEB_SUML1_R_LEN) - 1) << DSP2_MIDDLE3_AWB2_WHITEB_SUML1_R_POS)
#define DSP2_MIDDLE3_AWB2_WHITEB_SUML1_R_UMSK (~(((1U << DSP2_MIDDLE3_AWB2_WHITEB_SUML1_R_LEN) - 1) << DSP2_MIDDLE3_AWB2_WHITEB_SUML1_R_POS))
#define DSP2_MIDDLE3_AWB2_WHITEB_SUML0_R      DSP2_MIDDLE3_AWB2_WHITEB_SUML0_R
#define DSP2_MIDDLE3_AWB2_WHITEB_SUML0_R_POS  (16U)
#define DSP2_MIDDLE3_AWB2_WHITEB_SUML0_R_LEN  (9U)
#define DSP2_MIDDLE3_AWB2_WHITEB_SUML0_R_MSK  (((1U << DSP2_MIDDLE3_AWB2_WHITEB_SUML0_R_LEN) - 1) << DSP2_MIDDLE3_AWB2_WHITEB_SUML0_R_POS)
#define DSP2_MIDDLE3_AWB2_WHITEB_SUML0_R_UMSK (~(((1U << DSP2_MIDDLE3_AWB2_WHITEB_SUML0_R_LEN) - 1) << DSP2_MIDDLE3_AWB2_WHITEB_SUML0_R_POS))

/* 0x580 : awb2_sta_rc */
#define DSP2_MIDDLE3_AWB2_STA_RC_OFFSET       (0x580)
#define DSP2_MIDDLE3_AWB2_WHITEB_SUMH1_R      DSP2_MIDDLE3_AWB2_WHITEB_SUMH1_R
#define DSP2_MIDDLE3_AWB2_WHITEB_SUMH1_R_POS  (0U)
#define DSP2_MIDDLE3_AWB2_WHITEB_SUMH1_R_LEN  (32U)
#define DSP2_MIDDLE3_AWB2_WHITEB_SUMH1_R_MSK  (((1U << DSP2_MIDDLE3_AWB2_WHITEB_SUMH1_R_LEN) - 1) << DSP2_MIDDLE3_AWB2_WHITEB_SUMH1_R_POS)
#define DSP2_MIDDLE3_AWB2_WHITEB_SUMH1_R_UMSK (~(((1U << DSP2_MIDDLE3_AWB2_WHITEB_SUMH1_R_LEN) - 1) << DSP2_MIDDLE3_AWB2_WHITEB_SUMH1_R_POS))

/* 0x584 : awb2_sta_int */
#define DSP2_MIDDLE3_AWB2_STA_INT_OFFSET   (0x584)
#define DSP2_MIDDLE3_AWB2_GAIN_EN_PRE      DSP2_MIDDLE3_AWB2_GAIN_EN_PRE
#define DSP2_MIDDLE3_AWB2_GAIN_EN_PRE_POS  (0U)
#define DSP2_MIDDLE3_AWB2_GAIN_EN_PRE_LEN  (1U)
#define DSP2_MIDDLE3_AWB2_GAIN_EN_PRE_MSK  (((1U << DSP2_MIDDLE3_AWB2_GAIN_EN_PRE_LEN) - 1) << DSP2_MIDDLE3_AWB2_GAIN_EN_PRE_POS)
#define DSP2_MIDDLE3_AWB2_GAIN_EN_PRE_UMSK (~(((1U << DSP2_MIDDLE3_AWB2_GAIN_EN_PRE_LEN) - 1) << DSP2_MIDDLE3_AWB2_GAIN_EN_PRE_POS))
#define DSP2_MIDDLE3_AWB2_STAT_EN_PRE      DSP2_MIDDLE3_AWB2_STAT_EN_PRE
#define DSP2_MIDDLE3_AWB2_STAT_EN_PRE_POS  (1U)
#define DSP2_MIDDLE3_AWB2_STAT_EN_PRE_LEN  (1U)
#define DSP2_MIDDLE3_AWB2_STAT_EN_PRE_MSK  (((1U << DSP2_MIDDLE3_AWB2_STAT_EN_PRE_LEN) - 1) << DSP2_MIDDLE3_AWB2_STAT_EN_PRE_POS)
#define DSP2_MIDDLE3_AWB2_STAT_EN_PRE_UMSK (~(((1U << DSP2_MIDDLE3_AWB2_STAT_EN_PRE_LEN) - 1) << DSP2_MIDDLE3_AWB2_STAT_EN_PRE_POS))
#define DSP2_MIDDLE3_AWB2_BUF_IDX_R        DSP2_MIDDLE3_AWB2_BUF_IDX_R
#define DSP2_MIDDLE3_AWB2_BUF_IDX_R_POS    (2U)
#define DSP2_MIDDLE3_AWB2_BUF_IDX_R_LEN    (1U)
#define DSP2_MIDDLE3_AWB2_BUF_IDX_R_MSK    (((1U << DSP2_MIDDLE3_AWB2_BUF_IDX_R_LEN) - 1) << DSP2_MIDDLE3_AWB2_BUF_IDX_R_POS)
#define DSP2_MIDDLE3_AWB2_BUF_IDX_R_UMSK   (~(((1U << DSP2_MIDDLE3_AWB2_BUF_IDX_R_LEN) - 1) << DSP2_MIDDLE3_AWB2_BUF_IDX_R_POS))
#define DSP2_MIDDLE3_AWB2_W_CNT_R          DSP2_MIDDLE3_AWB2_W_CNT_R
#define DSP2_MIDDLE3_AWB2_W_CNT_R_POS      (8U)
#define DSP2_MIDDLE3_AWB2_W_CNT_R_LEN      (5U)
#define DSP2_MIDDLE3_AWB2_W_CNT_R_MSK      (((1U << DSP2_MIDDLE3_AWB2_W_CNT_R_LEN) - 1) << DSP2_MIDDLE3_AWB2_W_CNT_R_POS)
#define DSP2_MIDDLE3_AWB2_W_CNT_R_UMSK     (~(((1U << DSP2_MIDDLE3_AWB2_W_CNT_R_LEN) - 1) << DSP2_MIDDLE3_AWB2_W_CNT_R_POS))

