RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dsp2_middle3_reg.h
struct dsp2_middle3_reg {
    /* 0x0  reserved */
    uint8_t RESERVED0x0[1280];

    /* 0x500 : awb2_sta_xaxis */
    union {
        struct {
            uint32_t awb2_x_min_pre : 11; /* [10: 0],        r/w,        0x0 */
            uint32_t reserved_11_15 : 5;  /* [15:11],       rsvd,        0x0 */
            uint32_t awb2_x_max_pre : 11; /* [26:16],        r/w,      0x77f */
            uint32_t reserved_27_31 : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } awb2_sta_xaxis;

    /* 0x504 : awb2_sta_yaxis */
    union {
        struct {
            uint32_t awb2_y_min_pre : 11; /* [10: 0],        r/w,        0x0 */
            uint32_t reserved_11_15 : 5;  /* [15:11],       rsvd,        0x0 */
            uint32_t awb2_y_max_pre : 11; /* [26:16],        r/w,      0x437 */
            uint32_t reserved_27_31 : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } awb2_sta_yaxis;

    /* 0x508 : awb2_sta_pixel_num */
    union {
        struct {
            uint32_t awb2_pixel_num_pre : 21; /* [20: 0],        r/w,   0x1fa400 */
            uint32_t reserved_21_31     : 11; /* [31:21],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } awb2_sta_pixel_num;

    /* 0x50C : awb2_sta_gain0 */
    union {
        struct {
            uint32_t awb2_stat_ggain_pre : 16; /* [15: 0],        r/w,     0x1000 */
            uint32_t awb2_stat_rgain_pre : 16; /* [31:16],        r/w,     0x1000 */
        } BF;
        uint32_t WORD;
    } awb2_sta_gain0;

    /* 0x510 : awb2_sta_gain1 */
    union {
        struct {
            uint32_t awb2_rgain_pre      : 16; /* [15: 0],        r/w,     0x1000 */
            uint32_t awb2_stat_bgain_pre : 16; /* [31:16],        r/w,     0x1000 */
        } BF;
        uint32_t WORD;
    } awb2_sta_gain1;

    /* 0x514 : awb2_sta_gain2 */
    union {
        struct {
            uint32_t awb2_bgain_pre : 16; /* [15: 0],        r/w,     0x1000 */
            uint32_t awb2_ggain_pre : 16; /* [31:16],        r/w,     0x1000 */
        } BF;
        uint32_t WORD;
    } awb2_sta_gain2;

    /* 0x518 : awb2_sta_gain3 */
    union {
        struct {
            uint32_t awb2_vgain_pre : 10; /* [ 9: 0],        r/w,      0x100 */
            uint32_t reserved_10_15 : 6;  /* [15:10],       rsvd,        0x0 */
            uint32_t awb2_ugain_pre : 10; /* [25:16],        r/w,      0x100 */
            uint32_t reserved_26_31 : 6;  /* [31:26],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } awb2_sta_gain3;

    /* 0x51C : awb2_sta_l0 */
    union {
        struct {
            uint32_t awb2_yth1_pre : 8; /* [ 7: 0],        r/w,       0x10 */
            uint32_t awb2_yth2_pre : 8; /* [15: 8],        r/w,       0x30 */
            uint32_t awb2_yth3_pre : 8; /* [23:16],        r/w,       0xd0 */
            uint32_t awb2_yth4_pre : 8; /* [31:24],        r/w,       0xf0 */
        } BF;
        uint32_t WORD;
    } awb2_sta_l0;

    /* 0x520 : awb2_sta_l1 */
    union {
        struct {
            uint32_t awb2_yweight2_pre : 8; /* [ 7: 0],        r/w,       0xff */
            uint32_t awb2_yweight3_pre : 8; /* [15: 8],        r/w,       0xff */
            uint32_t awb2_yweight4_pre : 8; /* [23:16],        r/w,        0x0 */
            uint32_t awb2_yth0_pre     : 8; /* [31:24],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } awb2_sta_l1;

    /* 0x524 : awb2_sta_l2 */
    union {
        struct {
            uint32_t awb2_yslope4_pre  : 9; /* [ 8: 0],        r/w,        0x0 */
            uint32_t reserved_9_15     : 7; /* [15: 9],       rsvd,        0x0 */
            uint32_t awb2_yweight0_pre : 8; /* [23:16],        r/w,        0x0 */
            uint32_t awb2_yweight1_pre : 8; /* [31:24],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } awb2_sta_l2;

    /* 0x528 : awb2_sta_l3 */
    union {
        struct {
            uint32_t awb2_yslope2_pre : 9; /* [ 8: 0],        r/w,        0x0 */
            uint32_t reserved_9_15    : 7; /* [15: 9],       rsvd,        0x0 */
            uint32_t awb2_yslope3_pre : 9; /* [24:16],        r/w,      0x1e0 */
            uint32_t reserved_25_31   : 7; /* [31:25],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } awb2_sta_l3;

    /* 0x52C : awb2_sta_l4 */
    union {
        struct {
            uint32_t awb2_yslope0_pre : 9; /* [ 8: 0],        r/w,        0x0 */
            uint32_t reserved_9_15    : 7; /* [15: 9],       rsvd,        0x0 */
            uint32_t awb2_yslope1_pre : 9; /* [24:16],        r/w,       0x20 */
            uint32_t reserved_25_31   : 7; /* [31:25],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } awb2_sta_l4;

    /* 0x530 : awb2_sta_c0 */
    union {
        struct {
            uint32_t awb2_ureg4_pre : 8; /* [ 7: 0],        r/w,        0x0 */
            uint32_t awb2_ureg5_pre : 8; /* [15: 8],        r/w,        0x0 */
            uint32_t awb2_ureg6_pre : 8; /* [23:16],        r/w,        0x0 */
            uint32_t awb2_ureg7_pre : 8; /* [31:24],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } awb2_sta_c0;

    /* 0x534 : awb2_sta_c1 */
    union {
        struct {
            uint32_t awb2_ureg0_pre : 8; /* [ 7: 0],        r/w,        0x0 */
            uint32_t awb2_ureg1_pre : 8; /* [15: 8],        r/w,        0x0 */
            uint32_t awb2_ureg2_pre : 8; /* [23:16],        r/w,        0x0 */
            uint32_t awb2_ureg3_pre : 8; /* [31:24],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } awb2_sta_c1;

    /* 0x538 : awb2_sta_c2 */
    union {
        struct {
            uint32_t awb2_vreg4_pre : 8; /* [ 7: 0],        r/w,        0x0 */
            uint32_t awb2_vreg5_pre : 8; /* [15: 8],        r/w,        0x0 */
            uint32_t awb2_vreg6_pre : 8; /* [23:16],        r/w,        0x0 */
            uint32_t awb2_vreg7_pre : 8; /* [31:24],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } awb2_sta_c2;

    /* 0x53C : awb2_sta_c3 */
    union {
        struct {
            uint32_t awb2_vreg0_pre : 8; /* [ 7: 0],        r/w,        0x0 */
            uint32_t awb2_vreg1_pre : 8; /* [15: 8],        r/w,        0x0 */
            uint32_t awb2_vreg2_pre : 8; /* [23:16],        r/w,        0x0 */
            uint32_t awb2_vreg3_pre : 8; /* [31:24],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } awb2_sta_c3;

    /* 0x540 : awb2_sta_c4 */
    union {
        struct {
            uint32_t awb2_cth4_pre  : 6; /* [ 5: 0],        r/w,       0x10 */
            uint32_t reserved_6_7   : 2; /* [ 7: 6],       rsvd,        0x0 */
            uint32_t awb2_cth5_pre  : 6; /* [13: 8],        r/w,       0x10 */
            uint32_t reserved_14_15 : 2; /* [15:14],       rsvd,        0x0 */
            uint32_t awb2_cth6_pre  : 6; /* [21:16],        r/w,       0x10 */
            uint32_t reserved_22_23 : 2; /* [23:22],       rsvd,        0x0 */
            uint32_t awb2_cth7_pre  : 6; /* [29:24],        r/w,       0x10 */
            uint32_t reserved_30_31 : 2; /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } awb2_sta_c4;

