RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dsp2_middle3_reg.h
    /* 0x544 : awb2_sta_c5 */
    union {
        struct {
            uint32_t awb2_cth0_pre  : 6; /* [ 5: 0],        r/w,       0x10 */
            uint32_t reserved_6_7   : 2; /* [ 7: 6],       rsvd,        0x0 */
            uint32_t awb2_cth1_pre  : 6; /* [13: 8],        r/w,       0x10 */
            uint32_t reserved_14_15 : 2; /* [15:14],       rsvd,        0x0 */
            uint32_t awb2_cth2_pre  : 6; /* [21:16],        r/w,       0x10 */
            uint32_t reserved_22_23 : 2; /* [23:22],       rsvd,        0x0 */
            uint32_t awb2_cth3_pre  : 6; /* [29:24],        r/w,       0x10 */
            uint32_t reserved_30_31 : 2; /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } awb2_sta_c5;

    /* 0x548 : awb2_sta_c6 */
    union {
        struct {
            uint32_t awb2_cslope4_pre : 8; /* [ 7: 0],        r/w,       0x40 */
            uint32_t awb2_cslope5_pre : 8; /* [15: 8],        r/w,       0x40 */
            uint32_t awb2_cslope6_pre : 8; /* [23:16],        r/w,       0x40 */
            uint32_t awb2_cslope7_pre : 8; /* [31:24],        r/w,       0x40 */
        } BF;
        uint32_t WORD;
    } awb2_sta_c6;

    /* 0x54C : awb2_sta_c7 */
    union {
        struct {
            uint32_t awb2_cslope0_pre : 8; /* [ 7: 0],        r/w,       0x40 */
            uint32_t awb2_cslope1_pre : 8; /* [15: 8],        r/w,       0x40 */
            uint32_t awb2_cslope2_pre : 8; /* [23:16],        r/w,       0x40 */
            uint32_t awb2_cslope3_pre : 8; /* [31:24],        r/w,       0x40 */
        } BF;
        uint32_t WORD;
    } awb2_sta_c7;

    /* 0x550 : awb2_sta_r0 */
    union {
        struct {
            uint32_t awb2_g_avg0_r  : 12; /* [11: 0],          r,        0x0 */
            uint32_t reserved_12_15 : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t awb2_r_avg0_r  : 12; /* [27:16],          r,        0x0 */
            uint32_t reserved_28_31 : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } awb2_sta_r0;

    /* 0x554 : awb2_sta_r1 */
    union {
        struct {
            uint32_t awb2_white_ratio0_r : 15; /* [14: 0],          r,        0x0 */
            uint32_t reserved_15         : 1;  /* [   15],       rsvd,        0x0 */
            uint32_t awb2_b_avg0_r       : 12; /* [27:16],          r,        0x0 */
            uint32_t reserved_28_31      : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } awb2_sta_r1;

    /* 0x558 : awb2_sta_r2 */
    union {
        struct {
            uint32_t awb2_g_avg1_r  : 12; /* [11: 0],          r,        0x0 */
            uint32_t reserved_12_15 : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t awb2_r_avg1_r  : 12; /* [27:16],          r,        0x0 */
            uint32_t reserved_28_31 : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } awb2_sta_r2;

    /* 0x55C : awb2_sta_r3 */
    union {
        struct {
            uint32_t awb2_white_ratio1_r : 15; /* [14: 0],          r,        0x0 */
            uint32_t reserved_15         : 1;  /* [   15],       rsvd,        0x0 */
            uint32_t awb2_b_avg1_r       : 12; /* [27:16],          r,        0x0 */
            uint32_t reserved_28_31      : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } awb2_sta_r3;

    /* 0x560 : awb2_sta_r4 */
    union {
        struct {
            uint32_t awb2_whiter_sumh0_r : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } awb2_sta_r4;

    /* 0x564 : awb2_sta_r5 */
    union {
        struct {
            uint32_t awb2_whiter_suml1_r : 9; /* [ 8: 0],          r,        0x0 */
            uint32_t reserved_9_15       : 7; /* [15: 9],       rsvd,        0x0 */
            uint32_t awb2_whiter_suml0_r : 9; /* [24:16],          r,        0x0 */
            uint32_t reserved_25_31      : 7; /* [31:25],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } awb2_sta_r5;

    /* 0x568 : awb2_sta_r6 */
    union {
        struct {
            uint32_t awb2_whiter_sumh1_r : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } awb2_sta_r6;

    /* 0x56C : awb2_sta_r7 */
    union {
        struct {
            uint32_t awb2_whiteg_sumh0_r : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } awb2_sta_r7;

    /* 0x570 : awb2_sta_r8 */
    union {
        struct {
            uint32_t awb2_whiteg_suml1_r : 9; /* [ 8: 0],          r,        0x0 */
            uint32_t reserved_9_15       : 7; /* [15: 9],       rsvd,        0x0 */
            uint32_t awb2_whiteg_suml0_r : 9; /* [24:16],          r,        0x0 */
            uint32_t reserved_25_31      : 7; /* [31:25],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } awb2_sta_r8;

    /* 0x574 : awb2_sta_r9 */
    union {
        struct {
            uint32_t awb2_whiteg_sumh1_r : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } awb2_sta_r9;

    /* 0x578 : awb2_sta_ra */
    union {
        struct {
            uint32_t awb2_whiteb_sumh0_r : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } awb2_sta_ra;

    /* 0x57C : awb2_sta_rb */
    union {
        struct {
            uint32_t awb2_whiteb_suml1_r : 9; /* [ 8: 0],          r,        0x0 */
            uint32_t reserved_9_15       : 7; /* [15: 9],       rsvd,        0x0 */
            uint32_t awb2_whiteb_suml0_r : 9; /* [24:16],          r,        0x0 */
            uint32_t reserved_25_31      : 7; /* [31:25],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } awb2_sta_rb;

    /* 0x580 : awb2_sta_rc */
    union {
        struct {
            uint32_t awb2_whiteb_sumh1_r : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } awb2_sta_rc;

    /* 0x584 : awb2_sta_int */
    union {
        struct {
            uint32_t awb2_gain_en_pre : 1;  /* [    0],        r/w,        0x0 */
            uint32_t awb2_stat_en_pre : 1;  /* [    1],        r/w,        0x0 */
            uint32_t awb2_buf_idx_r   : 1;  /* [    2],          r,        0x0 */
            uint32_t reserved_3_7     : 5;  /* [ 7: 3],       rsvd,        0x0 */
            uint32_t awb2_w_cnt_r     : 5;  /* [12: 8],          r,        0x0 */
            uint32_t reserved_13_31   : 19; /* [31:13],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } awb2_sta_int;
};

typedef volatile struct dsp2_middle3_reg dsp2_middle3_reg_t;

#endif /* __DSP2_MIDDLE3_REG_H__ */
